<?php

return [
    "create" => "Товар № :value успешно добавлен!",
    "update"=> "Товар № :value успешно обновлен!",
    "delete" => "Товар № успешно удален!",

    "setActive" => "Товару № :value установлен статус 'Активен!'",
    "setNoActive" => "Товару № :value установлен статус 'Неактивен'!",
    "setReady" => "Тип товара № :value изменен на 'Одобрен'!",
    "setNoReady" => "Тип товара № :value изменен на 'Неодобрен', статус установлен 'Неактивен'!",
    "set_active_can_only_ready_type" => "Установить статус 'Активен', можно только одобренному товару!",
    "set_active_can_only_NOACTIVE_status" => "Установить статус 'Активен', можно только неактивный товар!",
    "set_NOACTIVE_can_only_active_status" => "Установить статус 'Неактивен', можно только активный товар!!",
    "set_no_good_can_not_reserv_AND_selled_status" => "Невозможно установить статус 'Неодобрен', зарезервированному или проданому товару",
    "emptyTovar" => "Необходимо указать данные хотябы одного товара!"
];